### Dictionary `data` convert to DataFrame

In [21]:
import pandas as pd

# dictionary

data = { 
    'Nombre': ['Fanny', 'Jaqui', 'Brenda', 'Memo', 'Emma', 'Diana', 'Alex'],
    'Calificaciones': ['100', '90', '97', '98', '89', '92', '89'],
    'Deportes': ['Futbol', 'Box', 'Karate', 'Judo', 'Basquetbol', 'Beisbol', 'Natacion'],
    'Materas': ['Algoritmos', 'Calculo', 'Algebra', 'Fisica', 'Quimica', 'Programacion', 'DevOps']
}

df = pd.DataFrame(data)
df

   Nombre Calificaciones    Deportes       Materas
0   Fanny            100      Futbol    Algoritmos
1   Jaqui             90         Box       Calculo
2  Brenda             97      Karate       Algebra
3    Memo             98        Judo        Fisica
4    Emma             89  Basquetbol       Quimica
5   Diana             92     Beisbol  Programacion
6    Alex             89    Natacion        DevOps

### Dictionary invalid `data`

In [48]:
import pandas as pd
import numpy as np

# dictionary invalid data

data = { 
    'Nombre': ['Fanny', 'Jaqui', 'Brenda', 'N/A', 'Emma', 'Diana', 'Alex'],
    'Calificaciones': ['100', '90', np.nan, '98', '89', '92', '89'],
    'Deportes': ['Futbol', 'Box', 'Karate', 'N/A', 'Basquetbol', 'Beisbol', 'Natacion'],
    'Materas': ['Algoritmos', 'Calculo', 'Algebra', 'Fisica', 'Quimica', 'Programacion', 'N/A']
}

df = pd.DataFrame(data)
# This method prints information about a DataFrame including the index dtype
# df.info()
# Generates descriptive statistics that summarize the central tendency.
# df.describe()
# df
new_df = pd.DataFrame(df)
new_df = new_df.replace(np.nan, '0')
new_df

   Nombre Calificaciones    Deportes       Materas
0   Fanny            100      Futbol    Algoritmos
1   Jaqui             90         Box       Calculo
2  Brenda              0      Karate       Algebra
3     N/A             98         N/A        Fisica
4    Emma             89  Basquetbol       Quimica
5   Diana             92     Beisbol  Programacion
6    Alex             89    Natacion           N/A

### Drop `np.nan` delete all row

In [52]:
import pandas as pd
import numpy as np

# dictionary invalid data

data = { 
    'Nombre': ['Fanny', 'Jaqui', 'Brenda', 'N/A', 'Emma', 'Diana', 'Alex'],
    'Calificaciones': ['100', '90', np.nan, '98', '89', '92', '89'],
    'Deportes': ['Futbol', 'Box', 'Karate', 'N/A', 'Basquetbol', 'Beisbol', 'Natacion'],
    'Materas': ['Algoritmos', 'Calculo', 'Algebra', 'Fisica', 'Quimica', 'Programacion', 'N/A']
}
df = pd.DataFrame(data)
new_df = pd.DataFrame(df)
new_df.dropna(how='any', inplace=True)
new_df

  Nombre Calificaciones    Deportes       Materas
0  Fanny            100      Futbol    Algoritmos
1  Jaqui             90         Box       Calculo
3    N/A             98         N/A        Fisica
4   Emma             89  Basquetbol       Quimica
5  Diana             92     Beisbol  Programacion
6   Alex             89    Natacion           N/A

### Delete record searching the column

In [53]:
import pandas as pd
import numpy as np

# dictionary invalid data

data = { 
    'Nombre': ['Fanny', 'Jaqui', 'Brenda', 'N/A', 'Emma', 'Diana', 'Alex'],
    'Calificaciones': ['100', '90', np.nan, '98', '89', '92', '89'],
    'Deportes': ['Futbol', 'Box', 'Karate', 'N/A', 'Basquetbol', 'Beisbol', 'Natacion'],
    'Materas': ['Algoritmos', 'Calculo', 'Algebra', 'Fisica', 'Quimica', 'Programacion', 'N/A']
}
df = pd.DataFrame(data)
columns = df[df['Nombre'] != 'N/A']
columns

   Nombre Calificaciones    Deportes       Materas
0   Fanny            100      Futbol    Algoritmos
1   Jaqui             90         Box       Calculo
2  Brenda            NaN      Karate       Algebra
4    Emma             89  Basquetbol       Quimica
5   Diana             92     Beisbol  Programacion
6    Alex             89    Natacion           N/A

### Replace NaN to 0 in my DF

In [62]:
import pandas as pd
import numpy as np

# dictionary invalid data

data = { 
    'Nombre': ['Fanny', 'Jaqui', 'Brenda', 'N/A', 'Emma', 'Diana', 'Alex'],
    'Calificaciones': ['100', '90', np.nan, '98', '89', '92', '89'],
    'Deportes': ['Futbol', 'Box', 'Karate', 'N/A', 'Basquetbol', 'Beisbol', 'Natacion'],
    'Materas': ['Algoritmos', 'Calculo', 'Algebra', 'Fisica', 'Quimica', 'Programacion', 'N/A']
}
df = pd.DataFrame(data)
new_df.fillna(0, inplace=True)
new_df.describe()

       Nombre Calificaciones Deportes     Materas
count       7              7        7           7
unique      7              6        7           7
top      Alex             89   Futbol  Algoritmos
freq        1              2        1           1

### Convert from `srt` to `int` in the column `Calificaciones`

In [70]:
import pandas as pd
import numpy as np

# dictionary invalid data

data = { 
    'Nombre': ['Fanny', 'Jaqui', 'Brenda', 'N/A', 'Emma', 'Diana', 'Alex'],
    'Calificaciones': ['100', '90', np.nan, '98', '89', '92', '89'],
    'Deportes': ['Futbol', 'Box', 'Karate', 'N/A', 'Basquetbol', 'Beisbol', 'Natacion'],
    'Materas': ['Algoritmos', 'Calculo', 'Algebra', 'Fisica', 'Quimica', 'Programacion', 'N/A']
}
df = pd.DataFrame(data)
df.fillna(0, inplace=True)
df['Calificaciones']=df.Calificaciones.astype(int)
df.describe()

       Calificaciones
count        7.000000
mean        79.714286
std         35.424635
min          0.000000
25%         89.000000
50%         90.000000
75%         95.000000
max        100.000000